
const Ticker = {
    A: '2.28800000',
    B: '2.37700000',
    // C: 1532175557223,
    E: 1532175557227,
    // F: 74070009,
    // L: 74227825,
    // O: 1532089157223,
    // P: '0.872',
    // Q: '0.02900000',

    a: '0.06256800',
    b: '0.06254100',

    // c: '0.06257000',
    // e: '24hrTicker',
    // h: '0.06326600',
    // l: '0.06037500',
    // n: 157817,
    // o: '0.06202900',
    // p: '0.00054100',
    // q: '7385.74711183',
    s: 'ETHBTC',
    v: '119476.39100000',
    // w: '0.06181763',
    // x: '0.06202900'
}

module.exports = function (A, B, a, b, s, E) {
    return { ...Ticker, A, B, a, b, s, E }
}


// [
//     "最新成交价",
//     "最近一笔成交的成交量",
//     "最大买一价",
//     "最大买一量",
//     "最小卖一价",
//     "最小卖一量",
//     "24小时前成交价",
//     "24小时内最高价",
//     "24小时内最低价",
//     "24小时内基准货币成交量, 如 btcusdt 中 btc 的量",
//     "24小时内计价货币成交量, 如 btcusdt 中 usdt 的量"
// ]